Revit 2027 API
View.CanCategoryBeHiddenTemporary Method
 Check if category can be temporarily hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanCategoryBeHiddenTemporary(
	ElementId elementId
)
Public Function CanCategoryBeHiddenTemporary (
	elementId As ElementId
) As Boolean
public:
bool CanCategoryBeHiddenTemporary(
	ElementId^ elementId
)
member CanCategoryBeHiddenTemporary :
        elementId : ElementId -> bool
Parameters
elementId ElementId
 Id of the category to be checked
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace